# 251124

def solution(letter):
    answer = ''
    
    morse = { 
    '.-':'a','-...':'b','-.-.':'c','-..':'d','.':'e','..-.':'f',
    '--.':'g','....':'h','..':'i','.---':'j','-.-':'k','.-..':'l',
    '--':'m','-.':'n','---':'o','.--.':'p','--.-':'q','.-.':'r',
    '...':'s','-':'t','..-':'u','...-':'v','.--':'w','-..-':'x',
    '-.--':'y','--..':'z'
    }
    
    codes = letter.split(' ') # 공백 기준으로 분리해서 리스트로 변환
    for code in codes:
        answer += morse[code]
        # 딕셔너리[key] -> 그 key에 해당하는 value를 반환해준다
    
    return answer